In [17]:
import pandas as pd
import numpy as np
pd_data = pd.DataFrame([[1,5,9]])
pd_data

   0  1  2
0  1  5  9

In [14]:
#创建pd_data
pd_data  =pd_data.append([[2,4,6]])

In [15]:
pd_data

   0  1  2
0  1  5  9
0  2  4  6

In [41]:
#创建有层次的数据
index_name =['first','second']
lay_index = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                 ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]
tuples = list(zip(*lay_index))
two_layers_index = pd.MultiIndex.from_tuples(tuples, names=index_name)
two_layers_index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [42]:
res = np.array([list(np.random.randn(8)),list(np.random.randn(8))]).T # 8行2列
pd_h = pd.DataFrame(res, index=two_layers_index, columns = ['A','B'])
pd_h

                     A         B
first second
bar   one     0.456591  0.951029
      two    -0.785345 -0.515015
baz   one    -0.167627 -1.253631
      two    -0.574593  0.917688
foo   one     1.765967  0.378062
      two    -0.964440  0.334514
qux   one     0.698132  0.451470
      two     1.820432 -0.348587

In [43]:
#pivot
df = pd.DataFrame({    'foo': ['one','one','one','two','two','two'],
                       'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                       'baz': [1, 2, 3, 4, 5, 6]})
df

  bar  baz  foo
0   A    1  one
1   B    2  one
2   C    3  one
3   A    4  two
4   B    5  two
5   C    6  two

In [48]:
df.pivot(index='bar', columns='baz', values='foo')

baz     1     2     3     4     5     6
bar
A     one  None  None   two  None  None
B    None   one  None  None   two  None
C    None  None   one  None  None   two

In [58]:
#排序
df = pd.DataFrame({'col1' : ['A', 'A', 'B', np.nan, 'D', np.nan], 'col2' : [2, 1, 9, 7, 7, 4], 'col3': [0, 1,np.nan,np.nan, 2, 3]})
df

  col1  col2  col3
0    A     2   0.0
1    A     1   1.0
2    B     9   NaN
3  NaN     7   NaN
4    D     7   2.0
5  NaN     4   3.0

In [60]:
#注意默认不是in-place排序，因此需要赋值等号左侧变量
sort_1and3 = df.sort_values(by=['col1','col3'])
sort_1and3

  col1  col2  col3
0    A     2   0.0
1    A     1   1.0
2    B     9   NaN
4    D     7   2.0
5  NaN     4   3.0
3  NaN     7   NaN

In [62]:
sort_2and3 = df.sort_values(by=['col2','col3'])
sort_2and3

  col1  col2  col3
1    A     1   1.0
0    A     2   0.0
5  NaN     4   3.0
4    D     7   2.0
3  NaN     7   NaN
2    B     9   NaN